[
  {
    "title": "Fight Back: Why Democrats Must Take the Fight to Red Territory",
    "date": "2025-08-14",
    "categories": [
      "politics",
      "local-elections",
      "strategy"
    ],
    "path": "posts/2025-08-14-fight-back-in-red-communities/",
    "description": "The time for playing defense is over. Democrats living in red states and red communities need to stop apologizing for existing and start taking what's..."
  },
  {
    "title": "The Epstein Files: Why Transparency and Accountability Matter More Than Politics",
    "date": "2025-08-04",
    "categories": [
      "politics",
      "justice",
      "accountability"
    ],
    "path": "posts/2025-08-04-epstein-files-accountability/",
    "description": "The recent Congressional battles over releasing the Jeffrey Epstein files have exposed a troubling reality: when it comes to protecting children and h..."
  },
  {
    "title": "Why Vote Democrat: Building a Future That Works for Everyone",
    "date": "2025-08-01",
    "categories": [
      "'Politics'",
      "'Democracy'"
    ],
    "path": "posts/2025-08-01-why-vote-democrat-building-future/",
    "description": "In a time of great challenges and opportunities, the Democratic Party offers concrete solutions that benefit working families, protect our environment, and strengthen our democracy. Here's why your vote matters."
  },
  {
    "title": "Doodle Trail Cleanup: Six Bags, Big Impact in Easley, SC",
    "date": "2025-04-26",
    "categories": [
      "'Volunteer'"
    ],
    "path": "posts/2025-04-26-doodle-trail-easley-cleanup/",
    "description": "The Easley community came together to clean up the Doodle Trail (Thanks to Darya for putting this toegher), filling six full bags of trash and making the trail shine again. See the highlights from a great day of teamwork and spirit!"
  },
  {
    "title": "The Nuremberg We Need - El Salvador Prison Release Response (Abrego Garcia)",
    "date": "2025-04-14",
    "categories": [],
    "path": "posts/2025-04-14-el-salvador/",
    "description": "This is what fascism looks like. We do not have rights according to this regime. And now Trump's saying he's open to sending American citizens convicted of violent crimes to the same prison. "
  },
  {
    "title": "Why the Easley UDO Review Matters",
    "date": "2025-04-10",
    "categories": [],
    "path": "posts/2025-04-19-easley-sc-udo-zoning-city-council/",
    "description": "A clear-eyed look at why continued U.S. support for Ukraine is not just a moral stance, but a strategic investment in America’s economic strength, global influence, and long-term national security."
  },
  {
    "title": "Stay with Ukraine",
    "date": "2025-04-05",
    "categories": [],
    "path": "posts/2025-04-05-war-on-ukraine-2025/",
    "description": "A clear-eyed look at why continued U.S. support for Ukraine is not just a moral stance, but a strategic investment in America’s economic strength, global influence, and long-term national security."
  },
  {
    "title": "Supporting Our Community During the Table Rock Wildfires",
    "date": "2025-03-27",
    "categories": [],
    "path": "posts/2025-03-27-wildfires-sc-volunteer-tablerock/",
    "description": "At first glance, H.Res.7 appears to promote compassionate women’s healthcare—but beneath its polished language lies a targeted ideological agenda - a bunch of bull shit. Tthe resolution’s hidden anti-contraception stance and the troubling trend of performative politics. Showmans ship, con artist, and bull shit artist is what we call it. Where is D.O.G.E. when it comes to political waste?"
  },
  {
    "title": "Words Don’t Match Deeds. H.Res.7 is Deception from Sherri Biggs",
    "date": "2025-03-24",
    "categories": [],
    "path": "posts/2025-03-24-words-and-more-lies-hr7/",
    "description": "At first glance, H.Res.7 appears to promote compassionate women’s healthcare—but beneath its polished language lies a targeted ideological agenda - a bunch of bull shit. Tthe resolution’s hidden anti-contraception stance and the troubling trend of performative politics. Showmans ship, con artist, and bull shit artist is what we call it. Where is D.O.G.E. when it comes to political waste?"
  },
  {
    "title": "Complex Issues with Simple Conversations",
    "date": "2025-03-21",
    "categories": [],
    "path": "posts/2025-03-21-complex-talk-lets-have-conversation/",
    "description": "Complex issues require conversations, so let's talk."
  },
  {
    "title": "Young Activists Shaping Greenville’s Future",
    "date": "2025-03-20",
    "categories": [],
    "path": "posts/2025-03-19-young-activisim-in-greenville-county/",
    "description": "A growing group of young activists in Greenville County is making waves through community engagement, volunteer work, and grassroots organizing. With a welcoming atmosphere and a focus on sustainable change, this movement is proving that real progress starts with taking action."
  },
  {
    "title": "Deep Red State - Why Campaign?",
    "date": "2025-03-16",
    "categories": [],
    "path": "posts/2025-03-15-independent-in-red-state-win-lose/",
    "description": "Growing movement in a deep red state."
  },
  {
    "title": "Save South Carolina State Parks",
    "date": "2025-03-13",
    "categories": [],
    "path": "posts/2025-03-13-hiking-save-the-parks-templates/",
    "description": "South Carolina’s forests are vital to our environment, economy, and way of life. We’re urging our representatives to fully fund, staff, and protect our state forests—leading by example instead of following harmful federal policies."
  },
  {
    "title": "Abundance Agenda",
    "date": "2025-03-10",
    "categories": [
      "\"Politics\""
    ],
    "path": "posts/2025-03-10-abundance-agenda/",
    "description": "Building with the Abundance Agenda – Easley, SC, and District 3 have the potential to grow by expanding supply in housing, transportation, jobs, and infrastructure. Instead of limiting progress, let’s remove barriers and create a future where opportunity is abundant for everyone."
  },
  {
    "title": "Blue Battle in a Red State",
    "date": "2025-03-10",
    "categories": [
      "\"Politics\""
    ],
    "path": "posts/2025-03-12-red-state-battle/",
    "description": "Running for Congress in a deep red district is about building momentum, giving a voice to the unheard, and pushing critical issues into the conversation. Even an “unwinnable” race can shape the future, energize voters, and lay the foundation for change."
  },
  {
    "title": "Every Vote Matters - SC District 3",
    "date": "2025-03-07",
    "categories": [
      "\"Politics\""
    ],
    "path": "posts/2025-03-07-every-vote-matters-disctrict3-sc/",
    "description": "In our district, over 200,000 people didn’t vote in the last election—that’s enough to change everything. The system stays broken when we stay home. Let’s change that. Read more and register to vote today."
  },
  {
    "title": "Sheri Biggs Canned Response on Ukraine",
    "date": "2025-03-04",
    "categories": [
      "\"Politics\""
    ],
    "path": "posts/2025-03-04-sherri-biggs-canned-response-ukraine/",
    "description": "Sheri Biggs’ response on Ukraine is a shallow, ill-informed, and reckless misrepresentation of U.S. foreign policy. Despite sitting on the House Foreign Affairs Committee’s East Asia and Pacific Subcommittee, she fails to grasp basic geopolitical realities. She completely ignores the 1994 Budapest Memorandum, where the U.S. promised to support Ukraine’s sovereignty in exchange for nuclear disarmament—making her argument not just misleading, but historically illiterate."
  },
  {
    "title": "H. 3457 Complete Abortion Ban - Bull Shit",
    "date": "2025-03-03",
    "categories": [
      "\"Career\"",
      "\"Politics\""
    ],
    "path": "posts/2025-03-03-south-carolina-aboring-ban/",
    "description": "This blog post breaks down H. 3457, South Carolina’s proposed total abortion ban, in plain language so that everyone can understand its real-world impacts."
  },
  {
    "title": "Running a Serious Campaign",
    "date": "2025-03-02",
    "categories": [
      "\"Career\"",
      "\"Politics\""
    ],
    "path": "posts/2025-03-01-monumental-task-but-doable/",
    "description": "Running for office isn’t something you just decide to do one day—it takes groundwork, connections, and a serious commitment. I’m laying out the steps I need to take now to give myself a real shot later. No fluff, just the hard truth about what it takes to run a serious campaign."
  },
  {
    "title": "Getting Politically Involved",
    "date": "2025-02-26",
    "categories": [
      "\"Career\"",
      "\"Politics\""
    ],
    "path": "posts/2025-02-26-running-for-politica-office/",
    "description": "I’ve been folliwing politics as a lay-person for a while now, but now I’m taking it seriously and with a purpose. This isn’t just casual interest anymore; it’s a focused effort to understand how and where real change happens. My goal is to think about the bigger picture and do something meaningful in the public interest. I see 2026 and 2028 as major stepping stones, and I’m using the next year to sharpen my knowledge. For now, it’s all about learning, engaging, and getting ready. 2025 is the year for exploring."
  }
]